In [8]:
#dataframe : modificacion del nombre de las filas
import numpy as np
import pandas as pd

In [9]:
filas = 'ventas1 ventas2 ventas3'.split()

In [10]:
columnas = 'zonaA zonaB zonaC'.split()

In [11]:
datos = [[100,200,250], [210,300,425], [250,310,124]]

In [13]:
dataframe = pd.DataFrame(datos,filas, columnas)
dataframe

         zonaA  zonaB  zonaC
ventas1    100    200    250
ventas2    210    300    425
ventas3    250    310    124

In [14]:
nuevas_filas = 'a b c'.split()

In [15]:
nuevas_filas

['a', 'b', 'c']

In [16]:
dataframe['dias'] = nuevas_filas

In [17]:
dataframe

         zonaA  zonaB  zonaC dias
ventas1    100    200    250    a
ventas2    210    300    425    b
ventas3    250    310    124    c

In [21]:
dataframe = dataframe.set_index('dias')

In [20]:
dataframe

         zonaA  zonaB  zonaC dias
ventas1    100    200    250    a
ventas2    210    300    425    b
ventas3    250    310    124    c

In [22]:
dataframe

      zonaA  zonaB  zonaC
dias
a       100    200    250
b       210    300    425
c       250    310    124